/*
импереативный  - описали КАК мы будем получать рузультат (пример ФОР)
декларативный - неважно как но важен Результат (пример МАП)

Функциональный:
принципы:
1) Неизменяемость данных - не изменять объекты а создавать новые
2) чистые функции - не имеют сайд эфектов (сторонних действий влияющих на сторонние объекты)
3) Функции высшего порядка  - функции которые принимают в себя другие функции
4) Каррирование - определение параметров ункции до ее вызова. (лёрн дваскрипт)
5) рекурсия - функция вызывает сама себя
6) композиция - последовательнось функций
*/

/// !!!!   выполнпить 1000 запросов, пакетами по 20шт
